app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page])
---
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"